schmttc/EasyThreeD-K7-STM32/EasyThreeDSupplied/mksRobinLite_nano/Middlewares/arduino/variant.h
/*
  Copyright (c) 2011 Arduino.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. 
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_MKS_STM32_H_
#define _VARIANT_MKS_STM32_H_

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		8000000

/** Master clock frequency */
#define VARIANT_MCK			72000000

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "Arduino.h"
#ifdef __cplusplus
//#include "UARTClass.h"
#include "USARTClass.h"
#endif

#ifdef __cplusplus
extern "C"{
#endif // __cplusplus

/**
 * Libc porting layers
 */
#if defined (  __GNUC__  ) /* GCC CS3 */
#    include <syscalls.h> /** RedHat Newlib minimal stub */
#endif

#define NONE ((uint8_t)0xFF)

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
//#define PINS_COUNT           (75u)
//tan 20161130
//#define PINS_COUNT           (87u)
#define PINS_COUNT           (89u)

//#define NUM_DIGITAL_PINS     (54u)
//tan 20161130
//#define NUM_DIGITAL_PINS     (75u) 
#define NUM_DIGITAL_PINS     (77u) 
#define NUM_ANALOG_INPUTS    (12u)

#define digitalPinToPort(P)        ( g_APinDescription[P].pPort )
#define digitalPinToBitMask(P)     ( g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->ODR) )
#define portInputRegister(port)    ( &(port->IDR) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulTimerChannel != NULL )
#define analogInputToDigitalPin(p)  ((p < 12) ? (p) + 54 : -1)


// LEDs
#define PIN_LED_13           (13u)
#define PIN_LED_RXL          -1//(72u)
#define PIN_LED_TXL          -1//(73u)
#define PIN_LED              PIN_LED_13
#define PIN_LED2             PIN_LED_RXL
#define PIN_LED3             PIN_LED_TXL

/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 3

#define SPI_INTERFACE        SPI1
#define SPI_INTERFACE_ID     -1//ID_SPI0
#define SPI_CHANNELS_NUM -1//4
//NSS use software control
#define PIN_SPI_SS0          -1//(59u)
#define PIN_SPI_SS1          -1//(60u)
#define PIN_SPI_SS2          -1//(61u)
#define PIN_SPI_SS3          -1//(62u)
#define PIN_SPI_MOSI         (65u)
#define PIN_SPI_MISO         (64u)
#define PIN_SPI_SCK          (63u)
#define BOARD_SPI_SS0        -1//(59u)
#define BOARD_SPI_SS1        -1//(60u)
#define BOARD_SPI_SS2        -1//(61u)
#define BOARD_SPI_SS3        -1//PIN_SPI_SS3
#define BOARD_SPI_DEFAULT_SS -1//BOARD_SPI_SS3


#define SPI_INTERFACE1        SPI2
#define PIN_SPI_MOSI1         (37u)
#define PIN_SPI_MISO1         (38u)
#define PIN_SPI_SCK1          (39u)

#define SPI_INTERFACE2        SPI3
#define PIN_SPI_MOSI2         (8u)
#define PIN_SPI_MISO2         (7u)
#define PIN_SPI_SCK2          (6u)


#define BOARD_PIN_TO_SPI_PIN(x) \
	(x==BOARD_SPI_SS0 ? PIN_SPI_SS0 : \
	(x==BOARD_SPI_SS1 ? PIN_SPI_SS1 : \
	(x==BOARD_SPI_SS2 ? PIN_SPI_SS2 : PIN_SPI_SS3 )))
#define BOARD_PIN_TO_SPI_CHANNEL(x) \
	(x==BOARD_SPI_SS0 ? 0 : \
	(x==BOARD_SPI_SS1 ? 1 : \
	(x==BOARD_SPI_SS2 ? 2 : 3)))

//static const uint8_t SS   = BOARD_SPI_SS0;
//static const uint8_t SS1  = BOARD_SPI_SS1;
//static const uint8_t SS2  = BOARD_SPI_SS2;
//static const uint8_t SS3  = BOARD_SPI_SS3;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;

static const uint8_t MOSI1 = PIN_SPI_MOSI1;
static const uint8_t MISO1 = PIN_SPI_MISO1;
static const uint8_t SCK1  = PIN_SPI_SCK1;

static const uint8_t MOSI2 = PIN_SPI_MOSI2;
static const uint8_t MISO2 = PIN_SPI_MISO2;
static const uint8_t SCK2  = PIN_SPI_SCK2;

/*
 * Wire Interfaces
 */
#define WIRE_INTERFACES_COUNT 2

#define PIN_WIRE_SDA         (20u)
#define PIN_WIRE_SCL         (21u)
#define WIRE_INTERFACE       I2C1
#define WIRE_INTERFACE_ID    ID_TWI1
#define WIRE_ISR_HANDLER     TWI1_Handler

#define PIN_WIRE1_SDA        (70u)
#define PIN_WIRE1_SCL        (71u)
#define WIRE1_INTERFACE      I2C2
#define WIRE1_INTERFACE_ID   ID_TWI0
#define WIRE1_ISR_HANDLER    TWI0_Handler

/*
 * UART/USART Interfaces
 */
// Serial
#define RX               (0u)  //PA10
#define TX               (1u)  //PA9
// Serial1
#define RX0              (15u) //PC11
#define TX0              (14u) //PC10
// Serial2
#define RX1              (17u) //PD6
#define TX1              (16u) //PD5
// Serial3
#define RX2              (70u) //PB10
#define TX2              (71u) //PB11

/*
 * USB Interfaces
 */
#define PINS_USB             (85u)

/*
 * Analog pins
 */
static const uint8_t A0  = 54;
static const uint8_t A1  = 55;
static const uint8_t A2  = 56;
static const uint8_t A3  = 57;
static const uint8_t A4  = 58;
static const uint8_t A5  = 59;
static const uint8_t A6  = 60;
static const uint8_t A7  = 61;
static const uint8_t A8  = 62;
static const uint8_t A9  = 63;
static const uint8_t A10 = 64;
static const uint8_t A11 = 65;
static const uint8_t DAC0 = 66;
static const uint8_t DAC1 = 67;
static const uint8_t A12 = 66;//same as DAC0
static const uint8_t A13 = 67;//same as DAC1
static const uint8_t A14 = 52;
static const uint8_t A15 = 53;
static const uint8_t CANRX = 68;
static const uint8_t CANTX = 69;
#define ADC_RESOLUTION		12

/*
 * DACC
 */
#define DACC_INTERFACE		DACC
#define DACC_INTERFACE_ID	ID_DACC
#define DACC_RESOLUTION		12
#define DACC_ISR_HANDLER    DACC_Handler
#define DACC_ISR_ID         DACC_IRQn

/*
 * PWM
 */
#define PWM_INTERFACE		PWM
#define PWM_INTERFACE_ID	ID_PWM
#define PWM_FREQUENCY		1000
#define PWM_MAX_DUTY_CYCLE	255
#define PWM_MIN_DUTY_CYCLE	0
#define PWM_RESOLUTION		8

/*
 * TC
 */
#define TC_INTERFACE        TC0
#define TC_INTERFACE_ID     ID_TC0
#define TC_FREQUENCY        1000
#define TC_MAX_DUTY_CYCLE   255
#define TC_MIN_DUTY_CYCLE   0
#define TC_RESOLUTION		8

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

//extern UARTClass Serial;
extern USARTClass Serial;
extern USARTClass Serial1;
extern USARTClass Serial2;
extern USARTClass Serial3;

#endif

#endif /* _VARIANT_MKS_STM32_H_ */

